source/0_Lesson.org
#+STARTUP:indent
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/styles.css"/>
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
#+HTML_HEAD_EXTRA: <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js" type="text/javascript"></script>
#+HTML_HEAD_EXTRA: <script src="js/navbar.js" type="text/javascript"></script>
#+OPTIONS: f:nil author:nil num:nil creator:nil timestamp:nil toc:nil html-style:nil

#+TITLE: Pygame
#+AUTHOR: Oliver Drayton

#+BEGIN_HTML
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-pyGame">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
#+END_HTML
* COMMENT Use as a template
:PROPERTIES:
:HTML_CONTAINER_CLASS: activity
:END:
** Learn It
:PROPERTIES:
:HTML_CONTAINER_CLASS: learn
:END:

** Research It
:PROPERTIES:
:HTML_CONTAINER_CLASS: research
:END:

** Design It
:PROPERTIES:
:HTML_CONTAINER_CLASS: design
:END:

** Build It
:PROPERTIES:
:HTML_CONTAINER_CLASS: build
:END:

** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:

** Run It
:PROPERTIES:
:HTML_CONTAINER_CLASS: run
:END:

** Document It
:PROPERTIES:
:HTML_CONTAINER_CLASS: document
:END:

** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:

** Program It
:PROPERTIES:
:HTML_CONTAINER_CLASS: program
:END:

** Try It
:PROPERTIES:
:HTML_CONTAINER_CLASS: try
:END:

** Badge It
:PROPERTIES:
:HTML_CONTAINER_CLASS: badge
:END:

** Save It
:PROPERTIES:
:HTML_CONTAINER_CLASS: save
:END:

* pyGame at home
 :PROPERTIES:
 :HTML_CONTAINER_CLASS: activity
 :END:
** Code It
:PROPERTIES:
:HTML_CONTAINER_CLASS: code
:END:
- You may wish to try making your own games at home.
- *Windows*
  - Step 1: Install [[https://www.python.org/ftp/python/3.2/python-3.2.msi][32-bit Python 3.2]].
  - Step 2: Install [[http://pygame.org/ftp/pygame-1.9.2a0.win32-py3.2.msi][pyGame 1.9.2]].


- *MacOS*
  - Follow the steps [[http://florian-berger.de/en/articles/installing-pygame-for-python-3-on-os-x/][here]]


- *Ubuntu Linux*
  - Open a terminal, and copy/paste these commands one at a time:

  - Change in to your home directory
#+begin_src python
cd ~
#+end_src

  - Pick up the pyGame source code
#+begin_src python
sudo apt-get install mercurial
hg clone https://bitbucket.org/pygame/pygame
cd pygame
#+end_src

  - Pick up some additional dependencies we'll need
#+begin_src python
sudo apt-get install python3-dev python3-numpy libsdl-dev libsdl-image1.2-dev \
  libsdl-mixer1.2-dev libsdl-ttf2.0-dev libsmpeg-dev libportmidi-dev \
  libavformat-dev libswscale-dev libjpeg-dev libfreetype6-dev
#+end_src

  - Build and install
#+begin_src python
python3 setup.py build
sudo python3 setup.py install
#+end_src
** Test It
:PROPERTIES:
:HTML_CONTAINER_CLASS: test
:END:
- To test your installation works, load IDLE, type =import pygame= in the console and hit enter. If you don't see any errors, you're ready to go.
