pages/0_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Pygame</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Pygame</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/stsb11/9-CS-pyGame">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">pyGame at home</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 code">
<h3 id="sec-1-1">Code It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>You may wish to try making your own games at home.
</li>
<li><b>Windows</b>
<ul class="org-ul">
<li>Step 1: Install <a href="https://www.python.org/ftp/python/3.2/python-3.2.msi">32-bit Python 3.2</a>.
</li>
<li>Step 2: Install <a href="http://pygame.org/ftp/pygame-1.9.2a0.win32-py3.2.msi">pyGame 1.9.2</a>.
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li><b>MacOS</b>
<ul class="org-ul">
<li>Follow the steps <a href="http://florian-berger.de/en/articles/installing-pygame-for-python-3-on-os-x/">here</a>
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li><b>Ubuntu Linux</b>
<ul class="org-ul">
<li>Open a terminal, and copy/paste these commands one at a time:
</li>

<li>Change in to your home directory
</li>
</ul>
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">cd ~
</pre>
</div>

<ul class="org-ul">
<li>Pick up the pyGame source code
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">sudo apt-get install mercurial
hg clone https://bitbucket.org/pygame/pygame
cd pygame
</pre>
</div>

<ul class="org-ul">
<li>Pick up some additional dependencies we'll need
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">sudo apt-get install python3-dev python3-numpy libsdl-dev libsdl-image1.2-dev \
  libsdl-mixer1.2-dev libsdl-ttf2.0-dev libsmpeg-dev libportmidi-dev \
  libavformat-dev libswscale-dev libjpeg-dev libfreetype6-dev
</pre>
</div>

<ul class="org-ul">
<li>Build and install
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">python3 setup.py build
sudo python3 setup.py install
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 test">
<h3 id="sec-1-2">Test It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>To test your installation works, load IDLE, type <code>import pygame</code> in the console and hit enter. If you don't see any errors, you're ready to go.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
